---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SectionBrokenDisplayStyle
source: html/c7043c2c-b5b4-bfc5-875f-59b01373c38e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SectionBrokenDisplayStyle Property

"Broken Section Display Style"

## Syntax (C#)
```csharp
public static ForgeTypeId SectionBrokenDisplayStyle { get; }
```